Revit 2027 API
Mesh.ComputeSurfaceArea Method
 Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ComputeSurfaceArea()
Public Function ComputeSurfaceArea As Double
public:
double ComputeSurfaceArea()
member ComputeSurfaceArea : unit -> float
Return Value
Double
 A double, representing the surface area.
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace